{
  "id": "cca-be2550",
  "type": "statute",
  "title_th": "พระราชบัญญัติว่าด้วยการกระทำความผิดเกี่ยวกับคอมพิวเตอร์ พ.ศ. 2550",
  "title_en": "Computer Crime Act B.E. 2550 (2007)",
  "short_name": "CCA 2007",
  "status": "in_force",
  "be_year": 2550,
  "ce_year": 2007,
  "issued_date": "2007-06-18",
  "in_force_date": "2007-07-18",
  "url": "https://www.krisdika.go.th/librarian/getfile?sysid=564700&fid=1&subfid=0",
  "description": "Thailand's principal cybercrime legislation, criminalising unauthorised access to computer systems, computer-related fraud, and various cybercrimes. Amended in B.E. 2560 (2017) to expand scope including content-related offences. Establishes authority for investigation and computer data seizure.",
  "provisions": [
    {
      "provision_ref": "s1",
      "section": "1",
      "title": "Short title",
      "content": "Section 1. This Act shall be called the Computer Crime Act, B.E. 2550 (2007).",
      "language": "en"
    },
    {
      "provision_ref": "s2",
      "section": "2",
      "title": "Commencement",
      "content": "Section 2. This Act shall come into force after the lapse of thirty days from the date of its publication in the Government Gazette.",
      "language": "en"
    },
    {
      "provision_ref": "s3",
      "section": "3",
      "title": "Definitions",
      "content": "Section 3. In this Act: 'computer system' means any device or group of interconnected or related devices, one or more of which, pursuant to a program, performs automatic processing of data; 'computer data' means data, statement, or instruction set which is in a computer system and which will enable the computer system to work; 'computer traffic data' means any data relating to a communication by means of a computer system, generated by a computer system that formed a part in the chain of communication, showing the communication's origin, destination, route, time, date, size, duration, or type of underlying service; 'service provider' means a person who provides services to other persons for communication by means of a computer system whether on the person's own behalf or for the benefit of another person, and includes a person who stores computer data for another person for their benefit.",
      "language": "en"
    },
    {
      "provision_ref": "s5",
      "section": "5",
      "title": "Unauthorised access to computer system",
      "content": "Section 5. Whoever illegally accesses a computer system for which a specific access prevention measure has been established without being authorised to do so shall be punished with imprisonment for a term not exceeding six months, or a fine not exceeding ten thousand Baht, or both.",
      "language": "en"
    },
    {
      "provision_ref": "s6",
      "section": "6",
      "title": "Unauthorised disclosure of security measures",
      "content": "Section 6. Whoever knows of a specific access prevention measure for a computer system and illegally discloses such measure in a manner likely to cause damage to another person shall be punished with imprisonment for a term not exceeding one year, or a fine not exceeding twenty thousand Baht, or both.",
      "language": "en"
    },
    {
      "provision_ref": "s7",
      "section": "7",
      "title": "Illegal access to computer data",
      "content": "Section 7. Whoever illegally accesses computer data for which a specific access prevention measure has been established without being authorised to do so shall be punished with imprisonment for a term not exceeding two years, or a fine not exceeding forty thousand Baht, or both.",
      "language": "en"
    },
    {
      "provision_ref": "s8",
      "section": "8",
      "title": "Illegal interception of computer data",
      "content": "Section 8. Whoever illegally intercepts computer data of another person that is being transmitted in a computer system and that is not intended for the public or for the use of the interceptor shall be punished with imprisonment for a term not exceeding three years, or a fine not exceeding sixty thousand Baht, or both.",
      "language": "en"
    },
    {
      "provision_ref": "s9",
      "section": "9",
      "title": "Interference with computer data",
      "content": "Section 9. Whoever illegally damages, destroys, corrects, changes, or adds to the computer data of another person, in whole or in part, shall be punished with imprisonment for a term not exceeding five years, or a fine not exceeding one hundred thousand Baht, or both.",
      "language": "en"
    },
    {
      "provision_ref": "s10",
      "section": "10",
      "title": "Interference with computer system",
      "content": "Section 10. Whoever commits any offence that causes the operation of a computer system of another person to be suspended, delayed, impeded, or disrupted to the extent of making such computer system unable to operate normally shall be punished with imprisonment for a term not exceeding five years, or a fine not exceeding one hundred thousand Baht, or both.",
      "language": "en"
    },
    {
      "provision_ref": "s11",
      "section": "11",
      "title": "Distribution of spam",
      "content": "Section 11. Whoever sends computer data or electronic mail to another person without enabling the recipient to easily refuse the receipt of such computer data or electronic mail, and such sending causes annoyance to the recipient, shall be punished with a fine not exceeding one hundred thousand Baht.",
      "language": "en"
    },
    {
      "provision_ref": "s12",
      "section": "12",
      "title": "Aggravated offences",
      "content": "Section 12. If the commission of any offence under Section 9 or Section 10: (1) causes damage, whether or not such damage is reparable, to the general public, it shall be punished with imprisonment for a term not exceeding ten years and a fine not exceeding two hundred thousand Baht; (2) is likely to cause damage to computer data or a computer system relating to national security, public safety, economic security, or public service, or is an offence against a computer system which is classified as critical infrastructure of the State, it shall be punished with imprisonment for a term of three to fifteen years and a fine of sixty thousand to three hundred thousand Baht; (3) causes death to any person, the offender shall be punished with imprisonment for a term of ten to twenty years.",
      "language": "en"
    },
    {
      "provision_ref": "s14",
      "section": "14",
      "title": "Content-related offences",
      "content": "Section 14. Any person who commits any of the following offences shall be punished with imprisonment for a term not exceeding five years, or a fine not exceeding one hundred thousand Baht, or both: (1) inputting into a computer system forged computer data, whether in whole or in part, or false computer data in a manner that is likely to cause damage to a third party or the public; (2) inputting into a computer system false computer data in a manner that is likely to damage national security or cause public panic; (3) inputting into a computer system any computer data constituting an offence relating to the security of the Kingdom or an offence relating to terrorism under the Criminal Code; (4) inputting into a computer system any obscene computer data which is accessible to the public; (5) publishing or forwarding computer data, knowing that it is computer data under (1), (2), (3), or (4).",
      "language": "en"
    },
    {
      "provision_ref": "s16",
      "section": "16",
      "title": "Misuse of images",
      "content": "Section 16. Whoever inputs into a computer system an edited image of another person, or an image created, modified, or edited to appear to be an image of another person, where such act: (1) is likely to damage the reputation, dignity, or to cause hatred or embarrassment of such other person; or (2) is likely to cause the public to be deceived; shall be punished with imprisonment for a term not exceeding three years, or a fine not exceeding two hundred thousand Baht, or both.",
      "language": "en"
    },
    {
      "provision_ref": "s18",
      "section": "18",
      "title": "Investigation powers",
      "content": "Section 18. To enforce the provisions of this Act, a competent official with the court's approval, except in the case of urgency, shall have the power to: (1) issue a written notice to any person to give statements in regard to facts concerning the commission of the offence; (2) request computer traffic data relating to the communication by means of a computer system from a service provider; (3) order a service provider to deliver computer data relating to the communication of a service user stored in a computer system, or which is in the possession or under the control of a service provider, as may be necessary for investigating the commission of an offence; (4) copy computer data from a computer system where there are reasonable grounds to believe that the offence under this Act has been committed; (5) order the person who possesses or controls computer data, or the equipment for keeping or accessing computer data, to deliver such computer data or equipment as may be necessary for investigating the commission of the offence; (6) inspect or access a computer system, computer data, computer traffic data, or equipment for keeping computer data.",
      "language": "en"
    },
    {
      "provision_ref": "s26",
      "section": "26",
      "title": "Data retention obligation",
      "content": "Section 26. A service provider shall retain computer traffic data for not less than ninety days from the date on which the data is input into a computer system. If necessary, a competent official may issue a written order instructing a specific service provider to retain computer traffic data for a period longer than ninety days, but not exceeding two years. A service provider who fails to comply with paragraph one or paragraph two shall be punished with a fine not exceeding five hundred thousand Baht.",
      "language": "en"
    }
  ]
}
